{
	"openai_api_key": "",
	"openai_model": "gpt-4o",
	"MOCK_API_RESPONSE": false,
	"vocab_query_presets": [
		{
			"name": "Missed today",
			"value": "rated:1:1"
		},
		{
			"name": "Missed last 3 days",
			"value": "rated:3:1"
		}
	],
	"theme_presets": [
		{
			"name": "No Theme",
			"value" : "No theme in particular"
		},
		{
			"name": "Superhero",
			"value": "superhero"
		},
		{
			"name": "Drama",
			"value": "drama show"
		},
		{
			"name": "News report",
			"value": "news report"
		},
		{
			"name": "Fantasy",
			"value": "fantasy"
		},
		{
			"name": "Random",
			"value": "Get crazy, go buck-wild, totally random, but maybe cohesive enough to still be understand"
		}

	],
	"prompt_presets": [
		{
			"name": "Default",
			"value": "Create a story in Japanese with the following vocabulary terms that will be listed individually on separate lines starting after the first empty newline. The theme you are given for this story is '{theme}'. Not every sentence has to have one of the vocabulary terms in it, but you must utilize every single vocabulary term provided. The length of the story can be as long as needed to encompass all of the vocabulary terms. Do not respond with any other text other than the story. Following are the vocabulary terms: \n\n{vocab}"
		},
		{
			"name": "Example Sentences",
			"value": "I need example sentences in Japanese with the following vocabulary terms that will be listed individually on separate lines starting after the first empty newline. The theme you are given for these sentences is '{theme}'. You must utilize every single vocabulary term provided. It should be exactly one sentence per provided vocabulary term. Do not respond with any other text other than the sentences. The sentences should be exactly one per line, with an empty newline in between each. Following are the vocabulary terms: \n\n{vocab}"
		}
	],
	"custom_vocab_query_presets": [],
	"custom_theme_presets": [],
	"custom_prompt_presets": [],
	"previous_stories": {},
	"max_stories_per_collection": 10,
	"note_type_field": {}
}
